In [1]:
import numpy as np       ### importing numpy and pandas
import pandas as pd

In [2]:
dataset = pd.read_csv("E:\MAYUKH\\naive bayes\\titanic\\titanic.csv")  ### import the csv dataset
dataset.head()          ### looking at the head of the csv dataset...

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
dataset.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True) ###Dropping the unwanted columns...
dataset.head()  ### After dropping the unwanted columns...

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
target=dataset.Survived                 ### Fixing Survived columns as target to predict the survivals...
inputs=dataset.drop('Survived',axis='columns') ### Columns other than "Survived" are taken as input...

In [5]:
dummies=pd.get_dummies(inputs.Sex) ### Converting the Sex column to integer type from text...
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns') ### Appending the dummy columns replacing Sex columns in inputs...
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop('Sex',axis='columns',inplace=True) ### Dropping the Sex column...
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
### Looking for missing data in any of the attributes in the data...

In [9]:
inputs.columns[inputs.isna().any()] ### Searching for any NaN value in any column...found in Age column...

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10] ###Looking for the NaN values in Age column...

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean()) ### Filling the NaN values with the mean of the Age column...  
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [12]:
### After replacing the missing values with the mean value...
### Again checking for any missing data in any of the attributes...

In [13]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [14]:
### So there are no more missing values ini any of the attrinutes in the data...